Rhino.Inside.Revit API
GeometryDecoder.ToTransform Method
 Converts the specified Autodesk.Revit.DB.Transform to an equivalent Rhino.Geometry.Transform.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rhino.Geometry.Transform ToTransform(
	this Autodesk.Revit.DB.Transform transform
)
@staticmethod
def ToTransform(
	transform: Autodesk.Revit.DB.Transform
) -> Rhino.Geometry.Transform
Parameters
transform
Type: Autodesk.Revit.DB.Transform
Revit transform to convert.
Return Value
Type: Rhino.Geometry.Transform
Rhino transform that is equivalent to the provided Revit transform.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Transform. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToTransform(Transform) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Transform rhinoTransform = revitTransform.ToTransform();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_transform = revit_transform.ToTransform() # type: RG.Transform
 Using ToTransform(Transform) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Transform rhinoTransform = GeometryEncoder.ToTransform(revitTransform)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_transform = GD.ToTransform(revit_transform) # type: RG.Transform
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace